{
  "input": "Text Input",
  "output": "Text Output",
  "input_number": "Numbers Input",
  "output_number": "Number Output",
  "encode": "Encode",
  "decode": "Decode",
  "decoded": "Decoded {{length}} chars",
  "case": "CASE STRATEGY",
  "foreign": "FOREIGN CHARS",
  "case_1": "Maintain case",
  "case_2": "Upper case",
  "case_3": "Lower case",
  "include": "include",
  "ignore": "ignore",
  "alphabet": "ALPHABET",
  "to_integer": "of two integers",
  "to_text": "to text",
  "key": "key",
  "utils_word": "Encode and Decode",
  "ceasar": "Ceasar cipher",
  "ceasar_desc": " is one of the simplest and most widely known encryption techniques. It is a type of substitution cipher in which each letter in the plaintext is replaced by a letter some fixed number of positions down the alphabet.",
  "affine": "Affine cipher",
  "affine_desc": " is a type of monoalphabetic substitution cipher, where each letter in an alphabet is mapped to its numeric equivalent, encrypted using a simple mathematical function, and converted back to a letter. Each letter is enciphered with the function (ax + b) mod 26, where b is the magnitude of the shift.",
  "reverse": "Reverse cipher",
  "reverse_desc": " uses a pattern of reversing the string of plain text to convert as cipher text. The process of encryption and decryption is same. To decrypt cipher text, the user simply needs to reverse the cipher text to get the plain text.",
  "transposition": "Transposition cipher",
  "transposition_desc": " is a method of encryption by which the positions held by units of plaintext (which are commonly characters or groups of characters) are shifted according to a regular system, so that the ciphertext constitutes a permutation of the plaintext.",
  "cal_modulo": "calculate Modulo",
  "oper_modulo": "Modulo operation",
  "cal": "calculate",
  "type_input": "TYPE INPUT",
  "type_1": "number",
  "type_2": "power",
  "type_3": "base",
  "type_4": "exponent",
  "modulo_desc": " returns the remainder or signed remainder of a division, after one number is divided by another (called the modulus of the operation). Given two positive numbers a and n, a modulo n (abbreviated as a mod n) is the remainder of the Euclidean division of a by n, where a is the dividend and n is the divisor. The modulo operation is to be distinguished from the symbol mod, which refers to the modulus (or divisor) one is operating from.",
  "simple_substitution": "Simple Substitution Cipher",
  "simple_substitution_desc": " can be demonstrated by writing out the alphabet in some order to represent the substitution. This is termed a substitution alphabet. The cipher alphabet may be shifted or reversed (creating the Caesar and Atbash ciphers, respectively) or scrambled in a more complex fashion, in which case it is called a mixed alphabet or deranged alphabet.",
  "mod_inverse": "Modular Inverse",
  "mod_inverse_desc": " of an integer a is an integer x such that the product ax is congruent to 1 with respect to the modulus m. In the standard notation of modular arithmetic this congruence is written as ax ≡ 1 (mod m ), which is the shorthand way of writing the statement that m divides (evenly) the quantity ax − 1, or, put another way, the remainder after dividing ax by the integer m is 1.",
  "oper_mod_inverse": "calculation Modulo inverse",
  "not_found": "Not Found. Please Check Your Input!",
  "vigenere": "Vigenere cipher",
  "vigenere_desc": " is a method of encrypting alphabetic text by using a series of interwoven Caesar ciphers, based on the letters of a keyword. It employs a form of polyalphabetic substitution.",
  "hill": "Hill cipher",
  "hill_desc": " is a polygraphic substitution cipher based on linear algebra. Invented by Lester S. Hill in 1929, it was the first polygraphic cipher in which it was practical (though barely) to operate on more than three symbols at once.",
  "hill_err_1": "The matrix is not invertible MOD 26. Please check your matrix!",
  "hill_err_2": "Only A-Za-z characters are accepted. Please check your text input!",
  "rot13": "Rot13 cipher",
  "rot13_desc": " is a simple letter substitution cipher that replaces a letter with the 13th letter after it in the alphabet. ROT13 is a special case of the Caesar cipher which was developed in ancient Rome.",
  "variant": "variant",
  "base64": "Base64 cipher",
  "base64_desc": " is a group of binary-to-text encoding schemes that represent binary data (more specifically, a sequence of 8-bit bytes) in an ASCII string format by translating the data into a radix-64 representation. The term Base64 originates from a specific MIME content transfer encoding. Each non-final Base64 digit represents exactly 6 bits of data. Three bytes (i.e., a total of 24 bits) can therefore be represented by four 6-bit Base64 digits.",
  "xor": "XOR cipher",
  "xor_desc": " is a type of additive cipher, an encryption algorithm that operates according to the principles: XOR operator. This operation is sometimes called modulus 2 addition (or subtraction, which is identical). With this logic, a string of text can be encrypted by applying the bitwise XOR operator to every character using a given key. To decrypt the output, merely reapplying the XOR function with the key will remove the cipher.",
  "multiplicative": "Multiplicative cipher",
  "multiplicative_desc": " is similar to additive cipher except the fact that the key bit is multiplied to the plain-text symbol during encryption. Likewise, the cipher-text is multiplied by the multiplicative inverse of key for decryption to obtain back the plain-text.",
  "des": "DES cipher",
  "des_desc": " (Data Encryption Standard) is a symmetric-key algorithm for the encryption of digital data. Although its short key length of 56 bits makes it too insecure for applications, it has been highly influential in the advancement of cryptography.",
  "encode_func": "Encode function",
  "decode_func": "Decode function",
  "encoding": "Encoding characters in string",
  "decoding": "Decoding characters in string",
  "ordinal": "has the ordinal number",
  "detail": "detail",
  "hide": "hide",
  "elgamal": "Elgamal cipher",
  "elgamal_desc": " is an asymmetric key encryption algorithm for public-key cryptography which is based on the Diffie–Hellman key exchange. It was described by Taher Elgamal in 1985. ElGamal encryption is used in the free GNU Privacy Guard software, recent versions of PGP, and other cryptosystems.",
  "params": "Params",
  "footer": " is a web application that provides modules for encrypting and decrypting common ciphers. In addition, CipherVip has utilities such as calculate modulo and modular inverse."
}
